added strip mining pattern
